zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cz_ca/pic32cz_ca80/pic32cz4010ca80208-pinctrl.h
/* pf4_gpio */
#define PF4_GPIO MCHP_PINMUX(f, 4, gpio, gpio)

/* pf4a_eic_extint4 */
#define PF4A_EIC_EXTINT4 MCHP_PINMUX(f, 4, a, periph)

/* pf4p_ptc_drv27 */
#define PF4P_PTC_DRV27 MCHP_PINMUX(f, 4, p, periph)

/* pf5_gpio */
#define PF5_GPIO MCHP_PINMUX(f, 5, gpio, gpio)

/* pf5a_eic_extint5 */
#define PF5A_EIC_EXTINT5 MCHP_PINMUX(f, 5, a, periph)

/* pf5p_ptc_drv21 */
#define PF5P_PTC_DRV21 MCHP_PINMUX(f, 5, p, periph)

/* pf6_gpio */
#define PF6_GPIO MCHP_PINMUX(f, 6, gpio, gpio)

/* pf6a_eic_extint6 */
#define PF6A_EIC_EXTINT6 MCHP_PINMUX(f, 6, a, periph)

/* pf6p_ptc_drv26 */
#define PF6P_PTC_DRV26 MCHP_PINMUX(f, 6, p, periph)

/* pf7_gpio */
#define PF7_GPIO MCHP_PINMUX(f, 7, gpio, gpio)

/* pf7a_eic_extint7 */
#define PF7A_EIC_EXTINT7 MCHP_PINMUX(f, 7, a, periph)

/* pf7p_ptc_drv25 */
#define PF7P_PTC_DRV25 MCHP_PINMUX(f, 7, p, periph)

/* pf8_gpio */
#define PF8_GPIO MCHP_PINMUX(f, 8, gpio, gpio)

/* pf8a_eic_extint8 */
#define PF8A_EIC_EXTINT8 MCHP_PINMUX(f, 8, a, periph)

/* pf8p_ptc_drv24 */
#define PF8P_PTC_DRV24 MCHP_PINMUX(f, 8, p, periph)

/* pg0_gpio */
#define PG0_GPIO MCHP_PINMUX(g, 0, gpio, gpio)

/* pg0a_eic_extint0 */
#define PG0A_EIC_EXTINT0 MCHP_PINMUX(g, 0, a, periph)

/* pg0d_sercom6_pad2 */
#define PG0D_SERCOM6_PAD2 MCHP_PINMUX(g, 0, d, periph)

/* pg0e_ebi_a17 */
#define PG0E_EBI_A17 MCHP_PINMUX(g, 0, e, periph)

/* pg0h_sqi1_data1 */
#define PG0H_SQI1_DATA1 MCHP_PINMUX(g, 0, h, periph)

/* pg0i_sdmmc1_sddat1 */
#define PG0I_SDMMC1_SDDAT1 MCHP_PINMUX(g, 0, i, periph)

/* pg1_gpio */
#define PG1_GPIO MCHP_PINMUX(g, 1, gpio, gpio)

/* pg1a_eic_extint1 */
#define PG1A_EIC_EXTINT1 MCHP_PINMUX(g, 1, a, periph)

/* pg1d_sercom6_pad3 */
#define PG1D_SERCOM6_PAD3 MCHP_PINMUX(g, 1, d, periph)

/* pg1e_ebi_a16 */
#define PG1E_EBI_A16 MCHP_PINMUX(g, 1, e, periph)

/* pg1h_sqi1_data2 */
#define PG1H_SQI1_DATA2 MCHP_PINMUX(g, 1, h, periph)

/* pg1i_sdmmc1_sddat2 */
#define PG1I_SDMMC1_SDDAT2 MCHP_PINMUX(g, 1, i, periph)

/* pg2_gpio */
#define PG2_GPIO MCHP_PINMUX(g, 2, gpio, gpio)

/* pg2a_eic_extint2 */
#define PG2A_EIC_EXTINT2 MCHP_PINMUX(g, 2, a, periph)

/* pg2e_ebi_a15 */
#define PG2E_EBI_A15 MCHP_PINMUX(g, 2, e, periph)

/* pg2h_sqi1_data3 */
#define PG2H_SQI1_DATA3 MCHP_PINMUX(g, 2, h, periph)

/* pg2i_sdmmc1_sddat3 */
#define PG2I_SDMMC1_SDDAT3 MCHP_PINMUX(g, 2, i, periph)

/* pg3_gpio */
#define PG3_GPIO MCHP_PINMUX(g, 3, gpio, gpio)

/* pg3a_eic_extint3 */
#define PG3A_EIC_EXTINT3 MCHP_PINMUX(g, 3, a, periph)

/* pg3e_ebi_a11 */
#define PG3E_EBI_A11 MCHP_PINMUX(g, 3, e, periph)

/* pg3h_sqi1_cs0 */
#define PG3H_SQI1_CS0 MCHP_PINMUX(g, 3, h, periph)

/* pg3i_sdmmc1_sdcmd */
#define PG3I_SDMMC1_SDCMD MCHP_PINMUX(g, 3, i, periph)

/* pg4_gpio */
#define PG4_GPIO MCHP_PINMUX(g, 4, gpio, gpio)

/* pg4a_eic_extint4 */
#define PG4A_EIC_EXTINT4 MCHP_PINMUX(g, 4, a, periph)

/* pg4e_ebi_nwe_nwr0 */
#define PG4E_EBI_NWE_NWR0 MCHP_PINMUX(g, 4, e, periph)

/* pg5_gpio */
#define PG5_GPIO MCHP_PINMUX(g, 5, gpio, gpio)

/* pg5a_eic_extint5 */
#define PG5A_EIC_EXTINT5 MCHP_PINMUX(g, 5, a, periph)

/* pg5f_tcc9_wo0 */
#define PG5F_TCC9_WO0 MCHP_PINMUX(g, 5, f, periph)

/* pg6_gpio */
#define PG6_GPIO MCHP_PINMUX(g, 6, gpio, gpio)

/* pg6a_eic_extint6 */
#define PG6A_EIC_EXTINT6 MCHP_PINMUX(g, 6, a, periph)

/* pg6f_tcc9_wo1 */
#define PG6F_TCC9_WO1 MCHP_PINMUX(g, 6, f, periph)

/* pg7_gpio */
#define PG7_GPIO MCHP_PINMUX(g, 7, gpio, gpio)

/* pg7a_eic_extint7 */
#define PG7A_EIC_EXTINT7 MCHP_PINMUX(g, 7, a, periph)

/* pg7f_tcc9_wo2 */
#define PG7F_TCC9_WO2 MCHP_PINMUX(g, 7, f, periph)

/* pg8_gpio */
#define PG8_GPIO MCHP_PINMUX(g, 8, gpio, gpio)

/* pg8a_eic_extint8 */
#define PG8A_EIC_EXTINT8 MCHP_PINMUX(g, 8, a, periph)

/* pg9_gpio */
#define PG9_GPIO MCHP_PINMUX(g, 9, gpio, gpio)

/* pg9a_eic_extint9 */
#define PG9A_EIC_EXTINT9 MCHP_PINMUX(g, 9, a, periph)

/* pg9f_tcc9_wo3 */
#define PG9F_TCC9_WO3 MCHP_PINMUX(g, 9, f, periph)

/* pg10_gpio */
#define PG10_GPIO MCHP_PINMUX(g, 10, gpio, gpio)

/* pg10a_eic_extint10 */
#define PG10A_EIC_EXTINT10 MCHP_PINMUX(g, 10, a, periph)

/* pg10f_tcc9_wo4 */
#define PG10F_TCC9_WO4 MCHP_PINMUX(g, 10, f, periph)

/* pg11_gpio */
#define PG11_GPIO MCHP_PINMUX(g, 11, gpio, gpio)

/* pg11a_eic_extint11 */
#define PG11A_EIC_EXTINT11 MCHP_PINMUX(g, 11, a, periph)

/* pg11f_tcc9_wo5 */
#define PG11F_TCC9_WO5 MCHP_PINMUX(g, 11, f, periph)

#endif /* MICROCHIP_PIC32CZ4010CA80208_PINCTRL_H_ */
